Public Member Functions | Protected Member Functions | Friends | List of all members
ACAPI::Element::OpeningDefault::Modifier Class Referencefinal
Element Manager
#include <OpeningDefault.hpp>
 Inheritance diagram for ACAPI::Element::OpeningDefault::Modifier:
 Public Member Functions
ModifiableOpeningFloorPlanParameters  | GetFloorPlanParameters ()
Gives access to OpeningFloorPlanParameters for modification.
ModifiableOpeningExtrusionParameters  | GetExtrusionParameters ()
Gives access to OpeningExtrusionParameters for modification.
 Protected Member Functions
Modifier (OpeningDefault &parent)
Constructs a Modifier with the given parent OpeningDefault.
 Friends
 class  | OpeningDefault
Detailed Description
It represents a modifiable OpeningDefault
Since
Archicad 29
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::Element::OpeningDefault::Modifier::Modifier  |  ( |  OpeningDefault & |  parent | )
protected
Constructs a Modifier with the given parent OpeningDefault.
Parameters
parent | The parent OpeningDefault.
Member Function Documentation
◆ GetExtrusionParameters()
 ModifiableOpeningExtrusionParameters ACAPI::Element::OpeningDefault::Modifier::GetExtrusionParameters  |  ( |   | )
Gives access to OpeningExtrusionParameters for modification.
Returns
Returns ModifiableOpeningExtrusionParameters
◆ GetFloorPlanParameters()
 ModifiableOpeningFloorPlanParameters ACAPI::Element::OpeningDefault::Modifier::GetFloorPlanParameters  |  ( |   | )
Gives access to OpeningFloorPlanParameters for modification.
Returns
Returns ModifiableOpeningFloorPlanParameters